ИС_СПОРТ_2022/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФамилияЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчествоЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПолисаОМС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/InformationRegisters/СоответствияПользователейИОрганизаций/СоответствияПользователейИОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствияПользователейИОрганизаций</name>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/InformationRegisters/ИсторияИзмененийФизическогоЛица/ИсторияИзмененийФизическогоЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияИзмененийФизическогоЛица</name>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/Catalogs/ФизическиеЛица/ObjectModule.bsl
#Область ОбработчикиСобытийОбъекта

Процедура ПередЗаписью(Отказ)
	
	// {Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
	Если ОбменДанными.Загрузка Тогда
         Возврат;
	 КонецЕсли;
	 
	// }Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
	
	УчетСпортсменовСервер.ЗаполнитьРеквизит(ЭтотОбъект, "Ответственный", ПараметрыСеанса.ТекущийПользователь);
	
	
	Если НЕ ЗначениеЗаполнено(ФамилияЛатиница) Тогда
		ФамилияЛатиница = УчетСпортсменовСервер.Транслит(Фамилия);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ИмяЛатиница) Тогда
		ИмяЛатиница = УчетСпортсменовСервер.Транслит(Имя);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ОтчествоЛатиница) Тогда
		ОтчествоЛатиница = УчетСпортсменовСервер.Транслит(Отчество);
	КонецЕсли;
	Если НЕ ДатаРождения = Дата(1,1,1) И ГодРождения = "" Тогда
		ГодРождения = СокрЛП(СтрЗаменить(Год(ДатаРождения)," ",""));
	КонецЕсли;	
	
КонецПроцедуры

// {Рарус adilas #9299 -Вести историю изменений физлица (какая организация когда изменила) 2020.09.11
//
Процедура ПриЗаписи(Отказ)
	// Вставить содержимое обработчика.
	Если ОбменДанными.Загрузка Тогда
         Возврат;
	Иначе
		Если Не Отказ Тогда
		СоответствиеФизическихЛицИОрганизацийСервер.ОбработкаПриЗаписиВСправочникФизическиеЛицаПриЗаписи(ЭтотОбъект, Ложь);
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СоответствияПользователейИОрганизаций.Пользователь КАК Пользователь,
			|	СоответствияПользователейИОрганизаций.Организация КАК Организация
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияПользователейИОрганизаций КАК СоответствияПользователейИОрганизаций
			|		ПО Пользователи.Ссылка = СоответствияПользователейИОрганизаций.Пользователь
			|ГДЕ
			|	Пользователи.Ссылка = &Пользователь";
		
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		
		Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();	
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
				// Добавление записи в независимый непериодический регистр сведений
				Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Пользователь) И НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Организация) Тогда
					
					НоваяЗапись = РегистрыСведений.ИсторияИзмененийФизическогоЛица.СоздатьМенеджерЗаписи();
					
					НоваяЗапись.Пользователь 		= ТекущийПользователь;
					НоваяЗапись.Организация 		= ВыборкаДетальныеЗаписи.Организация;
					НоваяЗапись.ДатаИзменения 		= ТекущаяДатаСеанса();
					НоваяЗапись.ФизическоеЛицо 		= Ссылка;
					
					НоваяЗапись.Записать();
					
					ОбщегоНазначения.СообщитьПользователю("Не найдено соответствий текущего пользователя и организации!");
				Иначе
					НоваяЗапись = РегистрыСведений.ИсторияИзмененийФизическогоЛица.СоздатьМенеджерЗаписи();
					
					НоваяЗапись.Пользователь 		= ВыборкаДетальныеЗаписи.Пользователь;
					НоваяЗапись.Организация 		= ВыборкаДетальныеЗаписи.Организация;
					НоваяЗапись.ДатаИзменения 		= ТекущаяДатаСеанса();
					НоваяЗапись.ФизическоеЛицо 		= Ссылка;
					
					НоваяЗапись.Записать();
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//}Рарус adilas #9299 -Вести историю изменений физлица (какая организация когда изменила) 2020.09.11

#КонецОбласти
